{
  "recipes": [
    {
      "id": "W8Yhgcd6",
      "title": "Банановый хлеб",
      "ingredients": [
        {
          "name": "Бананы",
          "qty": "3 штуки"
        },
        {
          "name": "Ванильный экстракт",
          "qty": "½ чайной ложки"
        },
        {
          "name": "Пшеничная мука",
          "qty": "180 г"
        },
        {
          "name": "Куриное яйцо",
          "qty": "1 штука"
        },
        {
          "name": "Сахар",
          "qty": "150 г"
        },
        {
          "name": "Соль",
          "qty": "щепотка"
        },
        {
          "name": "Разрыхлитель",
          "qty": "8 г"
        },
        {
          "name": "Сливочное масло",
          "qty": "90 г"
        }
      ],
      "time": 90,
      "difficulty": "средняя",
      "description": " Спелые бананы очистить и размять их в миске при помощи толкушки для картофеля. Добавить 80 г. растопленного сливочного масла. Добавить слегка взбитое вилкой яйцо, сахар, разрыхлитель, соль, ванильный экстракт и муку. Перемешать до однородности деревянной лопаткой.Перелить тесто в смазанную сливочным маслом форму и отправить в духовку, разогретую до 180 градусов, на 45-50 минут. Готовый хлеб вытащить из духовки, оставить на 10-15 минут. Затем можно вынуть его из формы, дать совсем остыть и подавать.",
      "calories": 317,
      "img": "http://localhost:8080/img/banana_bread.jpg"
    },
    {
      "id": "Ft5SNIg7",
      "title": "Лазанья",
      "ingredients": [
        {
          "name": "Смешанный фарш",
          "qty": "200 г"
        },
        {
          "name": "Консервированные помидоры кусочками",
          "qty": "½ банки"
        },
        {
          "name": "Сметана",
          "qty": "100 г"
        },
        {
          "name": "Плавленый сырок",
          "qty": "½ штуки"
        },
        {
          "name": "Готовые сухие листы лазаньи",
          "qty": "4 штуки"
        },
        {
          "name": "Специи",
          "qty": "по вкусу"
        },
        {
          "name": "Твердый сыр",
          "qty": "100 г"
        },
        {
          "name": "Белое вино",
          "qty": "2 столовые ложки"
        }
      ],
      "time": 90,
      "difficulty": "средняя",
      "description": "Отварить пасту для лазаньи. Сделать соус болоньезе: поджарить на сковороде фарш, чуть позже выложить туда томаты, добавить специи (соль, перец, базилик, орегано), вино, потушить 5 минут. Сделать сливочный соус: на сковороду выложить сметану, туда же нарезать плавленый сырок, на медленном огне потушить до образования однородной массы. Поделить оба соуса условно на 4 части. На смазанный маслом противень выкладывать слоями: паста — болоньезе — сливочный. Сверху посыпать тёртым сыром, выпекать в духовке до золотистой корочки.",
      "calories": 467,
      "img": "http://localhost:8080/img/lasagna.jpg"
    },
    {
      "id": "1qAdbV5I",
      "title": "Cуп-пюре с брокколи",
      "ingredients": [
        {
          "name": "Куриная грудка",
          "qty": "500 г"
        },
        {
          "name": "Капуста брокколи",
          "qty": "300 г"
        },
        {
          "name": "Картофель",
          "qty": "4 штуки"
        },
        {
          "name": "Морковь",
          "qty": "1 штука"
        },
        {
          "name": "Репчатый лук",
          "qty": "1 штука"
        },
        {
          "name": "Молотый чёрный перец",
          "qty": "по вкусу"
        },
        {
          "name": "Гренки",
          "qty": "100 г"
        },
        {
          "name": "Сливки",
          "qty": "1 стакан"
        },
        {
          "name": "Тёртый сыр пармезан",
          "qty": "100 г"
        },
        {
          "name": "Соль",
          "qty": "по вкусу"
        }
      ],
      "time": 50,
      "difficulty": "легко",
      "description": "Куриную грудку, луковицу положить в кастрюлю, залить водой и варить бульон, снимая образующуюся пенку. Через 30 минут в бульон добавить нарезанные кубиками картофель и морковь, варить до готовности овощей. Чтобы брокколи не потеряла цвет, положить ее в бульон в последнюю очередь, после чего готовить еще 10 минут. Посолить, поперчить по вкусу. Вынуть куриную грудку, нарезать на кубики. Суп перелить в блендер и измельчить, затем вновь вернуть в кастрюлю, добавить сливки, суп прогреть (не кипятить!!!). Разлить по тарелкам, добавить кусочки курицы. Посыпать тертым сыром пармезан и гренками.",
      "calories": 285,
      "img": "http://localhost:8080/img/soup_broccoli.jpg"
    },
    {
      "id": "Njkl3s9H",
      "title": "Венские вафли",
      "ingredients": [
        {
          "name": "Сливочное масло",
          "qty": "150 г"
        },
        {
          "name": "Куриное яйцо",
          "qty": "3 штуки"
        },
        {
          "name": "Сахар",
          "qty": "60 г"
        },
        {
          "name": "Молоко",
          "qty": "250 мл"
        },
        {
          "name": "Ваниль",
          "qty": "2 г"
        },
        {
          "name": "Пшеничная мука",
          "qty": "200 г"
        },
        {
          "name": "Разрыхлитель",
          "qty": "½ чайной ложки"
        }
      ],
      "time": 40,
      "difficulty": "легко",
      "description": "Масло растереть с сахаром и ванилью. Влить яйца и молоко. Размешать. Всыпать просеянную муку и разрыхлитель. Тщательно все перемешать. Прикрыть крышкой и оставить на 30 минут. Раскалить вафельницу в течение 10 минут. Смазать маслом. Ложкой выложить тесто на вафельницу. Выпекать 3–5 минут до золотистого цвета. Должны получиться нежные и мягкие венские вафли. Остывшие вафли можно посыпать сахарной пудрой, полить медом или сгущенкой.",
      "calories": 624,
      "img": "http://localhost:8080/img/waffles.jpg"
    },
    {
      "id": "iuHj5dfC",
      "title": "Равиоли с грибами",
      "ingredients": [
        {
          "name": "Вода",
          "qty": "1,25 стакана"
        },
        {
          "name": "Свежие грибы",
          "qty": "1 кг"
        },
        {
          "name": "Зеленый лук",
          "qty": "1 пучок"
        },
        {
          "name": "Пшеничная мука",
          "qty": "1 кг"
        },
        {
          "name": "Куриное яйцо",
          "qty": "2 штуки"
        },
        {
          "name": "Сливочное масло",
          "qty": "4 столовые ложки"
        },
        {
          "name": "Оливковое масло",
          "qty": "6 столовые ложки"
        },
        {
          "name": "Сливки 30%",
          "qty": "2 столовые ложки"
        },
        {
          "name": "Твердый сыр",
          "qty": "30 г"
        },
        {
          "name": "Петрушка",
          "qty": "60 г"
        },
        {
          "name": "Соль",
          "qty": "по вкусу"
        },
        {
          "name": "Молотый чёрный перец",
          "qty": "по вкусу"
        }
      ],
      "time": 80,
      "difficulty": "сложно",
      "description": "Замесить тесто. Смешать муку и соль. Яйца взбить с оливковым маслом и водой. Постепенно вливая яичную смесь в муку, замесить упругое, эластичное тесто. Готовое тесто накрыть салфеткой и оставить на 30 минут. Приготовить начинку. Мелко порубить грибы (можно взять лисички, белые грибы, грузди) и лук, обжарить их на сливочном масле. Добавить сливки (можно сметану), посолить, поперчить и тушить 10 минут. Начинка должна быть сочной. Тесто раскатать в 2 одинаковых тонких пласта. На один пласт теста разложить по 1 чайной ложке начинки на расстоянии 3–5 см друг от друга. Накрыть вторым пластом, плотно прижать пальцами пласты вокруг начинки, затем разрезать их на квадраты. Варить равиоли в кипящей подсоленной воде 5–7 минут. Вынуть шумовкой, выложить на блюдо, заправить маслом, посыпать тертым сыром и зеленью. Отдельно можно подать кетчуп.",
      "calories": 501,
      "img": "http://localhost:8080/img/ravioli.jpeg"
    },
    {
      "id": "T2Fgva3q",
      "title": "Овсяное печенье из Starbucks",
      "ingredients": [
        {
          "name": "Сахар",
          "qty": "59 г"
        },
        {
          "name": "Разрыхлитель",
          "qty": "2 г"
        },
        {
          "name": "Молотая корица",
          "qty": "5 г"
        },
        {
          "name": "Пшеничная мука",
          "qty": "1 стакан"
        },
        {
          "name": "Куриное яйцо",
          "qty": "1 штукa"
        },
        {
          "name": "Ванилин",
          "qty": "5 г"
        },
        {
          "name": "Сливочное масло",
          "qty": "120 г"
        },
        {
          "name": "Сухофрукты",
          "qty": "2 столовые ложки"
        },
        {
          "name": "Белый шоколад",
          "qty": "50 г"
        },
        {
          "name": "Овсяные хлопья быстрого приготовления",
          "qty": "1 стакан"
        }
      ],
      "time": 50,
      "difficulty": "легко",
      "description": "Взбить масло с сахаром. Добавить яйцо и еще раз взбить. Добавить соль, разрыхлитель, корицу, ванилин, еще раз взбить. Добавить овсяные хлопья, тщательно перемешать массу. Добавить мелко порубленный шоколад и сухофрукты, перемешать. Добавить муку, тщательно размять тесто руками (ложкой уже не получится). Разделить тесто на 12 частей, скатать из них шарики и выложить на противень, застеленный бумагой для выпечки, подальше друг от друга. Выпекать в духовке, разогретой до 180 градусов, 15 минут. Вынуть и остудить на противне, когда немного затвердеют — можно снимать.",
      "calories": 198,
      "img": "http://localhost:8080/img/cookies.jpg"
    },
    {
      "id": "f7YtG89o",
      "title": "Ризотто по‑милански",
      "ingredients": [
        {
          "name": "Рис",
          "qty": "499 г"
        },
        {
          "name": "Куриный бульон",
          "qty": "1,5 л"
        },
        {
          "name": "Пармезан",
          "qty": "50 г"
        },
        {
          "name": "Репчатый лук",
          "qty": "200 г"
        },
        {
          "name": "Лук порей",
          "qty": "100 г"
        },
        {
          "name": "Чеснок",
          "qty": "2 зубчика"
        },
        {
          "name": "Шафран",
          "qty": "на кончике ножа"
        },
        {
          "name": "Помидоры",
          "qty": "100 г"
        },
        {
          "name": "Сливочное масло",
          "qty": "120 г"
        },
        {
          "name": "Оливковое масло",
          "qty": "50 мл"
        },
        {
          "name": "Белое сухое вино",
          "qty": "50 мл"
        },
        {
          "name": "Петрушка",
          "qty": "20 г"
        },
        {
          "name": "Соль",
          "qty": "по вкусу"
        },
        {
          "name": "Молотый чёрный перец",
          "qty": "по вкусу"
        }
      ],
      "time": 25,
      "difficulty": "средняя",
      "description": "Развести в 50 мл кипятка щепотку шафрана. Репчатый лук, чеснок и порей мелко порубить. На смеси масел (100 г сливочного и 50 мл оливкового) обжарить до почти прозрачной мягкости лук, добавить чеснок и порей и обжарить их до появления чесночного аромата. Порей за это время успеет стать мягким. Добавить рис и жарить его с овощами две-три минуты. Рис должен основательно пропитаться маслом. Влить треть имеющегося бульона, белое вино и варить рис, постоянно помешивая. Как только бульон закипит, огонь надо уменьшить. Чтобы жидкость лишь слегка побулькивала. Варить, постоянно помешивая и добавляя бульон. Через пять минут влить в рис настой шафрана и продолжать историю с помешиванием и доливом бульона. Минут через пятнадцать можно начать пробовать рис, и как только вам покажется, что он почти готов, только где-то внутри рисинки еще таится чуть-чуть твердости, надо посолить и поперчить ризотто, перемешать его с мелко нарубленной петрушкой, добавить еще чуть-чуть бульона, остаток сливочного масла (20 г), две минуты варить, помешивая. Снять с огня и разложить по тарелкам, добавив в каждую немного салата из мелко нарубленных свежих помидоров, перемешанных с оливковым маслом и небольшим количеством рубленого лука, и посыпать тертым пармезаном.",
      "calories": 861,
      "img": "http://localhost:8080/img/risotto.jpg"
    },
    {
      "id": "P-PABSjoY",
      "title": "Брауни",
      "ingredients": [
        {
          "name": "Темный шоколад",
          "id": "1",
          "qty": "100 г"
        },
        {
          "name": "Сливочное масло",
          "id": "2",
          "qty": "180 г"
        },
        {
          "name": "Коричневый сахар",
          "id": "3",
          "qty": "200 г"
        },
        {
          "qty": "4 штуки",
          "id": "4",
          "name": "Куриное яйцо"
        },
        {
          "name": "Пшеничная мука",
          "id": "5",
          "qty": "100 г"
        },
        {
          "name": "Грецкие орехи",
          "id": "6",
          "qty": "100 г"
        }
      ],
      "time": "40",
      "difficulty": "средняя",
      "description": "1. Шоколад разломать на кусочки и вместе со сливочным маслом растопить на водяной бане, не переставая все время помешивать лопаткой или деревянной ложкой. Получившийся густой шоколадный соус снять с водяной бани и оставить остывать.\n2. Тем временем смешать яйца со ста граммами коричневого сахара: яйца разбить в отдельную миску и взбить, постепенно добавляя сахар. Взбивать можно при помощи миксера или вручную — как больше нравится, — но не меньше двух с половиной-трех минут.\n3. Острым ножом на разделочной доске порубить грецкие орехи. Предварительно их можно поджарить на сухой сковороде до появления аромата, но это необязательная опция.\n4. В остывший растопленный со сливочным маслом шоколад аккуратно добавить оставшийся сахар, затем муку и измельченные орехи и все хорошо перемешать венчиком.\n5. Затем влить сахарно-яичную смесь и тщательно смешать с шоколадной массой. Цвет у теста должен получиться равномерным, без разводов.\n6. Разогреть духовку до 200 градусов. Дно небольшой глубокой огнеупорной формы выстелить листом бумаги для выпечки или калькой. Перелить тесто в форму. Поставить в духовку и выпекать двадцать пять — тридцать минут до появления сахарной корочки.\n7. Готовый пирог вытащить из духовки, дать остыть и нарезать на квадратики острым ножом или ножом для пиццы — так кусочки получатся особенно ровными.\n8. Подавать брауни можно просто так, а можно посыпать сверху сахарной пудрой или разложить квадратики по тарелкам и украсить каждую порцию шариком ванильного мороженого.\n",
      "calories": "676",
      "img": "http://localhost:8080/img/18737-1000_545_1589289193-7553.jpg"
    },
    {
      "id": "MENNEX2V4",
      "title": "Безе",
      "ingredients": [
        {
          "name": " Сахар",
          "id": "1",
          "qty": "150 г"
        },
        {
          "name": "Яичный белок",
          "id": "2",
          "qty": "3 штуки"
        },
        {
          "name": "Ванильный сахар",
          "id": "3",
          "qty": "2 чайные ложки"
        }
      ],
      "time": "70",
      "difficulty": "легко",
      "description": "Смешиваем 150 г сахара и 2 чайные ложки (но можно и побольше, так запах будет на весь дом) ванильного сахара. Главное — тщательно отделить белки от желтков, иначе белки будут плохо взбиваться и ничего не выйдет. Я беру две чашечки, в одну аккуратно выливаю белки, в другой остаются желтки (их можно прикрыть фольгой, убрать в холодильник и потом что-нибудь тоже из них сделать). Берем какую-нибудь миску, в которой будем взбивать белки (у меня для этого есть специальная пластмассовая посудина, в ней можно взбивать все, что угодно), миксер, и вперед! Важно, конечно, чтобы миксер был мощный. Если все в порядке, то 3–5 минут должно вполне хватить, чтобы получилась крепкая пена, которая не вывалится, даже если вы опрокинете миску вверх дном. Высыпаем сахар из стакана, взбиваем еще минут 5. Пока сахар более менее не станет с пеной одним целым. Дело сделано! Чтобы проверить, насколько все идеально, можно провести венчиками миксера по поверхности пены, и если останутся неподвижные следы, то все ок! На противень кладем лист бумаги для выпекания, чтобы подходил по размеру. Ну и накладываем на него будущие безе в любой форме! Я делаю волшебные штучки с помощью пакетика с разными насадками (что-то вроде кондитерского шприца, только попроще). Можно сделать маленькие безе или большие. Маленькие, кстати, быстрее выпекаются. Ставим в духовку при 120 градусах, на 50–60–80 минут.\n",
      "calories": "61",
      "img": "http://localhost:8080/img/13996-960m.jpg"
    },
    {
      "id": "2NpWcwaDt",
      "title": "Шарлотка",
      "ingredients": [
        {
          "name": "Сахар",
          "id": "1",
          "qty": "1 стакан"
        },
        {
          "name": "Куриное яйцо",
          "id": "2",
          "qty": "4 штуки"
        },
        {
          "name": "Пшеничная мука",
          "id": "3",
          "qty": "1 стакан"
        },
        {
          "qty": "1 кг",
          "id": "4",
          "name": "Яблоки"
        },
        {
          "name": "Соль",
          "id": "5",
          "qty": "на кончике ножа"
        },
        {
          "name": "Сода",
          "id": "6",
          "qty": "½ чайной ложки"
        }
      ],
      "time": "30",
      "difficulty": "средняя",
      "description": "1. Белки взбить с половиной стакана сахара.\n2. Желтки взбить с оставшимся сахаром.\n3. Соединить все вместе и постепенно добавить муку.\n4. Добавить соль и соду.\n5. Добавить нарезанные кубиками яблоки.\n6. Форму для выпекания смазать маслом и посыпать манной крупой.\n7. Выложить массу в форму и поставить в духовку, разогретую до 180 градусов.\n8. Выпекать 30-40 минут.",
      "calories": "582",
      "img": "http://localhost:8080/img/16990-recept_6724_1plp.jpg"
    },
    {
      "id": "5_6_nINgL",
      "title": "Сырные тосты",
      "ingredients": [
        {
          "name": "Белый хлеб",
          "id": "1",
          "qty": "6 кусков"
        },
        {
          "qty": "10 г",
          "id": "2",
          "name": "Сливочное масло"
        },
        {
          "qty": "70 г",
          "id": "3",
          "name": "Сыр"
        },
        {
          "qty": "25 мл",
          "id": "4",
          "name": "Растительное масло"
        }
      ],
      "time": "15",
      "difficulty": "легко",
      "description": "Обычные ломтики белого хлеба разделяем на 2 стопки. На первые 3 ломтика кладем кусочек сыра, сверху — ломтик масла сливочного. Оставшимися ломтиками хлеба из второй стопки накрываем сверху получившиеся бутерброды. На раскаленную сковороду наливаем растительного масла, кладем будущие тосты, но особенным способом. Сверху необходимо придавить тосты, положив на них чего-нибудь тяжеленькое (например, тарелку, а на тарелку кастрюльку с супчиком). Через несколько минут переворачиваем тосты и таким же образом придавливаем их.",
      "calories": "257",
      "img": "http://localhost:8080/img/15355-tost.jpg"
    },
    {
      "id": "xIpJtF2Dr",
      "title": "Моти",
      "ingredients": [
        {
          "name": "Рисовая мука",
          "id": "1",
          "qty": "350 г"
        },
        {
          "name": "Вода",
          "id": "2",
          "qty": "200 мл"
        },
        {
          "name": "Сахар",
          "id": "3",
          "qty": "200 г"
        },
        {
          "name": "Уксус",
          "id": "4",
          "qty": "2 мл"
        },
        {
          "name": "Шоколад",
          "id": "5",
          "qty": "100 г"
        },
        {
          "name": "Фрукты",
          "id": "6",
          "qty": "по вкусу"
        }
      ],
      "time": "60",
      "difficulty": "сложно",
      "description": "Возьмите миску среднюю по объему, высыпьте в нее муку, сахар и вылейте воду. Мешайте, пока не получится однородная масса. Теперь добавьте пару капель уксуса. Это делается для того, чтобы тесто было очень мягким, воздушным. (Если вы готовите угощение для ребенка, насыпьте немного пищевого красителя, тогда ваши шарики получатся разноцветные и веселые).  Далее слепите из заготовленного теста шарики, разомните их в лепешки, в центр поместите начинку и вновь сделайте шарики. Заключительный этап. Поместите шарики в микроволновую печь, накройте пленкой и поставьте на четыре-пять минут. Затем дайте полностью остыть и только после этого подавайте к столу.",
      "calories": "660",
      "img": "http://localhost:8080/img/11369-p_O.jpg"
    },
    {
      "id": "2BzChi4HI",
      "title": "Bla ",
      "ingredients": [
        {
          "name": "Bla",
          "id": "1",
          "qty": "1"
        }
      ],
      "time": "1",
      "difficulty": "сложно",
      "description": "Bla-bla-bla",
      "calories": "1",
      "img": "http://localhost:8080/img/10860-kitten.jpg"
    }
  ]
}