{
  "recipes": [
    {
      "id": "W8Yhgcd6",
      "title": "Банановый хлеб",
      "ingredients": [
        {
          "name": "Бананы",
          "qty": "3 штуки"
        },
        {
          "name": "Ванильный экстракт",
          "qty": "½ чайной ложки"
        },
        {
          "name": "Пшеничная мука",
          "qty": "180 г"
        },
        {
          "name": "Куриное яйцо",
          "qty": "1 штука"
        },
        {
          "name": "Сахар",
          "qty": "150 г"
        },
        {
          "name": "Соль",
          "qty": "щепотка"
        },
        {
          "name": "Разрыхлитель",
          "qty": "8 г"
        },
        {
          "name": "Сливочное масло",
          "qty": "90 г"
        }
      ],
      "time": 90,
      "difficulty": "средняя",
      "description": " Спелые бананы очистить и размять их в миске при помощи толкушки для картофеля. Добавить 80 г. растопленного сливочного масла. Добавить слегка взбитое вилкой яйцо, сахар, разрыхлитель, соль, ванильный экстракт и муку. Перемешать до однородности деревянной лопаткой.Перелить тесто в смазанную сливочным маслом форму и отправить в духовку, разогретую до 180 градусов, на 45-50 минут. Готовый хлеб вытащить из духовки, оставить на 10-15 минут. Затем можно вынуть его из формы, дать совсем остыть и подавать.",
      "calories": 317,
      "img": "http://localhost:8080/img/banana_bread.jpg"
    },
    {
      "id": "Ft5SNIg7",
      "title": "Лазанья",
      "ingredients": [
        {
          "name": "Смешанный фарш",
          "qty": "200 г"
        },
        {
          "name": "Консервированные помидоры кусочками",
          "qty": "½ банки"
        },
        {
          "name": "Сметана",
          "qty": "100 г"
        },
        {
          "name": "Плавленый сырок",
          "qty": "½ штуки"
        },
        {
          "name": "Готовые сухие листы лазаньи",
          "qty": "4 штуки"
        },
        {
          "name": "Специи",
          "qty": "по вкусу"
        },
        {
          "name": "Твердый сыр",
          "qty": "100 г"
        },
        {
          "name": "Белое вино",
          "qty": "2 столовые ложки"
        }
      ],
      "time": 90,
      "difficulty": "средняя",
      "description": "Отварить пасту для лазаньи. Сделать соус болоньезе: поджарить на сковороде фарш, чуть позже выложить туда томаты, добавить специи (соль, перец, базилик, орегано), вино, потушить 5 минут. Сделать сливочный соус: на сковороду выложить сметану, туда же нарезать плавленый сырок, на медленном огне потушить до образования однородной массы. Поделить оба соуса условно на 4 части. На смазанный маслом противень выкладывать слоями: паста — болоньезе — сливочный. Сверху посыпать тёртым сыром, выпекать в духовке до золотистой корочки.",
      "calories": 467,
      "img": "http://localhost:8080/img/lasagna.jpg"
    },
    {
      "id": "1qAdbV5I",
      "title": "Cуп-пюре с брокколи",
      "ingredients": [
        {
          "name": "Куриная грудка",
          "qty": "500 г"
        },
        {
          "name": "Капуста брокколи",
          "qty": "300 г"
        },
        {
          "name": "Картофель",
          "qty": "4 штуки"
        },
        {
          "name": "Морковь",
          "qty": "1 штука"
        },
        {
          "name": "Репчатый лук",
          "qty": "1 штука"
        },
        {
          "name": "Молотый чёрный перец",
          "qty": "по вкусу"
        },
        {
          "name": "Гренки",
          "qty": "100 г"
        },
        {
          "name": "Сливки",
          "qty": "1 стакан"
        },
        {
          "name": "Тёртый сыр пармезан",
          "qty": "100 г"
        },
        {
          "name": "Соль",
          "qty": "по вкусу"
        }
      ],
      "time": 50,
      "difficulty": "легко",
      "description": "Куриную грудку, луковицу положить в кастрюлю, залить водой и варить бульон, снимая образующуюся пенку. Через 30 минут в бульон добавить нарезанные кубиками картофель и морковь, варить до готовности овощей. Чтобы брокколи не потеряла цвет, положить ее в бульон в последнюю очередь, после чего готовить еще 10 минут. Посолить, поперчить по вкусу. Вынуть куриную грудку, нарезать на кубики. Суп перелить в блендер и измельчить, затем вновь вернуть в кастрюлю, добавить сливки, суп прогреть (не кипятить!!!). Разлить по тарелкам, добавить кусочки курицы. Посыпать тертым сыром пармезан и гренками.",
      "calories": 285,
      "img": "http://localhost:8080/img/soup_broccoli.jpg"
    },
    {
      "id": "Njkl3s9H",
      "title": "Венские вафли",
      "ingredients": [
        {
          "name": "Сливочное масло",
          "qty": "150 г"
        },
        {
          "name": "Куриное яйцо",
          "qty": "3 штуки"
        },
        {
          "name": "Сахар",
          "qty": "60 г"
        },
        {
          "name": "Молоко",
          "qty": "250 мл"
        },
        {
          "name": "Ваниль",
          "qty": "2 г"
        },
        {
          "name": "Пшеничная мука",
          "qty": "200 г"
        },
        {
          "name": "Разрыхлитель",
          "qty": "½ чайной ложки"
        }
      ],
      "time": 40,
      "difficulty": "легко",
      "description": "Масло растереть с сахаром и ванилью. Влить яйца и молоко. Размешать. Всыпать просеянную муку и разрыхлитель. Тщательно все перемешать. Прикрыть крышкой и оставить на 30 минут. Раскалить вафельницу в течение 10 минут. Смазать маслом. Ложкой выложить тесто на вафельницу. Выпекать 3–5 минут до золотистого цвета. Должны получиться нежные и мягкие венские вафли. Остывшие вафли можно посыпать сахарной пудрой, полить медом или сгущенкой.",
      "calories": 624,
      "img": "http://localhost:8080/img/waffles.jpg"
    },
    {
      "id": "iuHj5dfC",
      "title": "Равиоли с грибами",
      "ingredients": [
        {
          "name": "Вода",
          "qty": "1,25 стакана"
        },
        {
          "name": "Свежие грибы",
          "qty": "1 кг"
        },
        {
          "name": "Зеленый лук",
          "qty": "1 пучок"
        },
        {
          "name": "Пшеничная мука",
          "qty": "1 кг"
        },
        {
          "name": "Куриное яйцо",
          "qty": "2 штуки"
        },
        {
          "name": "Сливочное масло",
          "qty": "4 столовые ложки"
        },
        {
          "name": "Оливковое масло",
          "qty": "6 столовые ложки"
        },
        {
          "name": "Сливки 30%",
          "qty": "2 столовые ложки"
        },
        {
          "name": "Твердый сыр",
          "qty": "30 г"
        },
        {
          "name": "Петрушка",
          "qty": "60 г"
        },
        {
          "name": "Соль",
          "qty": "по вкусу"
        },
        {
          "name": "Молотый чёрный перец",
          "qty": "по вкусу"
        }
      ],
      "time": 80,
      "difficulty": "сложно",
      "description": "Замесить тесто. Смешать муку и соль. Яйца взбить с оливковым маслом и водой. Постепенно вливая яичную смесь в муку, замесить упругое, эластичное тесто. Готовое тесто накрыть салфеткой и оставить на 30 минут. Приготовить начинку. Мелко порубить грибы (можно взять лисички, белые грибы, грузди) и лук, обжарить их на сливочном масле. Добавить сливки (можно сметану), посолить, поперчить и тушить 10 минут. Начинка должна быть сочной. Тесто раскатать в 2 одинаковых тонких пласта. На один пласт теста разложить по 1 чайной ложке начинки на расстоянии 3–5 см друг от друга. Накрыть вторым пластом, плотно прижать пальцами пласты вокруг начинки, затем разрезать их на квадраты. Варить равиоли в кипящей подсоленной воде 5–7 минут. Вынуть шумовкой, выложить на блюдо, заправить маслом, посыпать тертым сыром и зеленью. Отдельно можно подать кетчуп.",
      "calories": 501,
      "img": "http://localhost:8080/img/ravioli.jpeg"
    },
    {
      "id": "T2Fgva3q",
      "title": "Овсяное печенье из Starbucks",
      "ingredients": [
        {
          "name": "Сахар",
          "qty": "59 г"
        },
        {
          "name": "Разрыхлитель",
          "qty": "2 г"
        },
        {
          "name": "Молотая корица",
          "qty": "5 г"
        },
        {
          "name": "Пшеничная мука",
          "qty": "1 стакан"
        },
        {
          "name": "Куриное яйцо",
          "qty": "1 штукa"
        },
        {
          "name": "Ванилин",
          "qty": "5 г"
        },
        {
          "name": "Сливочное масло",
          "qty": "120 г"
        },
        {
          "name": "Сухофрукты",
          "qty": "2 столовые ложки"
        },
        {
          "name": "Белый шоколад",
          "qty": "50 г"
        },
        {
          "name": "Овсяные хлопья быстрого приготовления",
          "qty": "1 стакан"
        }
      ],
      "time": 50,
      "difficulty": "легко",
      "description": "Взбить масло с сахаром. Добавить яйцо и еще раз взбить. Добавить соль, разрыхлитель, корицу, ванилин, еще раз взбить. Добавить овсяные хлопья, тщательно перемешать массу. Добавить мелко порубленный шоколад и сухофрукты, перемешать. Добавить муку, тщательно размять тесто руками (ложкой уже не получится). Разделить тесто на 12 частей, скатать из них шарики и выложить на противень, застеленный бумагой для выпечки, подальше друг от друга. Выпекать в духовке, разогретой до 180 градусов, 15 минут. Вынуть и остудить на противне, когда немного затвердеют — можно снимать.",
      "calories": 198,
      "img": "http://localhost:8080/img/cookies.jpg"
    },
    {
      "id": "f7YtG89o",
      "title": "Ризотто по‑милански",
      "ingredients": [
        {
          "name": "Рис",
          "qty": "499 г"
        },
        {
          "name": "Куриный бульон",
          "qty": "1,5 л"
        },
        {
          "name": "Пармезан",
          "qty": "50 г"
        },
        {
          "name": "Репчатый лук",
          "qty": "200 г"
        },
        {
          "name": "Лук порей",
          "qty": "100 г"
        },
        {
          "name": "Чеснок",
          "qty": "2 зубчика"
        },
        {
          "name": "Шафран",
          "qty": "на кончике ножа"
        },
        {
          "name": "Помидоры",
          "qty": "100 г"
        },
        {
          "name": "Сливочное масло",
          "qty": "120 г"
        },
        {
          "name": "Оливковое масло",
          "qty": "50 мл"
        },
        {
          "name": "Белое сухое вино",
          "qty": "50 мл"
        },
        {
          "name": "Петрушка",
          "qty": "20 г"
        },
        {
          "name": "Соль",
          "qty": "по вкусу"
        },
        {
          "name": "Молотый чёрный перец",
          "qty": "по вкусу"
        }
      ],
      "time": 25,
      "difficulty": "средняя",
      "description": "Развести в 50 мл кипятка щепотку шафрана. Репчатый лук, чеснок и порей мелко порубить. На смеси масел (100 г сливочного и 50 мл оливкового) обжарить до почти прозрачной мягкости лук, добавить чеснок и порей и обжарить их до появления чесночного аромата. Порей за это время успеет стать мягким. Добавить рис и жарить его с овощами две-три минуты. Рис должен основательно пропитаться маслом. Влить треть имеющегося бульона, белое вино и варить рис, постоянно помешивая. Как только бульон закипит, огонь надо уменьшить. Чтобы жидкость лишь слегка побулькивала. Варить, постоянно помешивая и добавляя бульон. Через пять минут влить в рис настой шафрана и продолжать историю с помешиванием и доливом бульона. Минут через пятнадцать можно начать пробовать рис, и как только вам покажется, что он почти готов, только где-то внутри рисинки еще таится чуть-чуть твердости, надо посолить и поперчить ризотто, перемешать его с мелко нарубленной петрушкой, добавить еще чуть-чуть бульона, остаток сливочного масла (20 г), две минуты варить, помешивая. Снять с огня и разложить по тарелкам, добавив в каждую немного салата из мелко нарубленных свежих помидоров, перемешанных с оливковым маслом и небольшим количеством рубленого лука, и посыпать тертым пармезаном.",
      "calories": 861,
      "img": "http://localhost:8080/img/risotto.jpg"
    }
  ]
}